In [1]:
## UFuncs: Index Alignment
# index alignment in series
import pandas as pd
import numpy as np
rng = np.random.RandomState(0)

In [2]:
area = pd.Series({'Nairobi' : 1723337, 'Texas' : 695662,
                  'California' : 423967}, name='area')
population = pd.Series({'California' : 38332521, 'Texas' : 213414111,
                        'New York':34324342,}, name = 'population')
population / area

California     90.413926
Nairobi              NaN
New York             NaN
Texas         306.778451
dtype: float64

In [3]:
area.index | population.index

Index(['California', 'Nairobi', 'New York', 'Texas'], dtype='object')

In [4]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  12  15
1   0   3

In [5]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BCA'))
B

   B  C  A
0  3  7  9
1  3  5  2
2  4  7  6

In [6]:
A + B

      A     B   C
0  21.0  18.0 NaN
1   2.0   6.0 NaN
2   NaN   NaN NaN

In [7]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  21.0  18.0  14.5
1   2.0   6.0  12.5
2  13.5  11.5  14.5

In [8]:
## Ufuncs: Operations Between DataFrame and Series
A = rng.randint(10, size=(3, 4))
A

array([[8, 8, 1, 6],
       [7, 7, 8, 1],
       [5, 9, 8, 9]])

In [9]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -1,  7, -5],
       [-3,  1,  7,  3]])

In [10]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  8  8  1  6
1  7  7  8  1
2  5  9  8  9

In [11]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  0  0 -7 -2
1  0  0  1 -6
2 -4  0 -1  0

In [12]:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
S    1
Name: 0, dtype: int64

In [13]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  7.0 NaN
2 -3.0 NaN  7.0 NaN

In [14]:
## Operating on Null Values
## Detecting null values

In [15]:
data = pd.Series([1, np.nan, 'hello', None])

In [16]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [17]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [18]:
## Droping null values
data.dropna()

0        1
2    hello
dtype: object

In [25]:
df = pd.DataFrame([[1,  np.nan, 2],
              [2,  3,      5],
              [np.nan, 4,  6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [21]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [26]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [27]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [30]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [33]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [34]:
## Filling null values

In [35]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [36]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [39]:
# foward fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [40]:
# Backfill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [41]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [42]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [43]:
df.fillna(method='bfill', axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN